# RebarShapeConstraint180DegreeBendRadius Class

---
A constraint which can be applied to a RebarShapeSegment, and causes the segment to be replaced with a 180-degree arc. The associated parameter drives the radius of the arc.
SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraint180DegreeBendRadius
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarShapeConstraint180DegreeBendRadius : RebarShapeConstraint

    Public Class RebarShapeConstraint180DegreeBendRadius
    	Inherits RebarShapeConstraint

    public ref class RebarShapeConstraint180DegreeBendRadius : public RebarShapeConstraint

    type RebarShapeConstraint180DegreeBendRadius =
        class
            inherit RebarShapeConstraint
        end
The RebarShapeConstraint180DegreeBendRadius type exposes the following members.
| Name| Description
---|---|---
| RebarShapeConstraint180DegreeBendRadius|  Create a 180-degree bend constraint driven by radius.
Top
| Name| Description
---|---|---
| ArcReferenceType|  A choice of rule for measuring the radius.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from RebarShapeConstraint)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParamId|  Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace